# Pandas

* Pandas is an open source library built on top of NumPy
* It allows for fast analysis and data cleaning and preparation 
* It excels in performance and productivity
* It has built-in visualization features
* It can work with data from a wide variety of sources

### Installing pandas 
`conda install pandas`

In [70]:
#import 
import numpy as np
import pandas as pd

### Pandas Series

#####  Creating a Pandas Series

In [2]:
# Labeled indices
labels = ['apartment', 'apartment', 'house', 'dorm', 'dorm', 'townhouse', 'apartment', 'townhouse', 'apartment','compound', 'compound']
# Set of unlabeled data
my_data = ['Rawda1', 'Rawda2', 'Naim', 'Rieber', 'Hedrick', 'Palazzo', 'Atrium1', 'AtriumFoy', 'Atrium3', 'Venice', 'Soma'] 

# Create a pandas series with the data and corresponding labeled indices
pd.Series(data= my_data, index = labels)

apartment       Rawda1
apartment       Rawda2
house             Naim
dorm            Rieber
dorm           Hedrick
townhouse      Palazzo
apartment      Atrium1
townhouse    AtriumFoy
apartment      Atrium3
compound        Venice
compound          Soma
dtype: object

In [3]:
# you can also use a numpy array as the data or index
labels = np.array(['first', 'Second', 'Third', 'Fourth'])
my_data = np.array(['Rayan', 'Sara', 'Salma', 'Omar'])

pd.Series(my_data,labels)

first     Rayan
Second     Sara
Third     Salma
Fourth     Omar
dtype: object

In [4]:
# You can also create a Series from a dictionary (key becomes index, value becomes data point)
labeled_data = {'Snoop': 'Dogg', 'Wiz': 'Khalifa', 'Mac': 'Miller', 'Lil': 'Wayne', 'Young': 'Thug'}
pd.Series(labeled_data)

Snoop       Dogg
Wiz      Khalifa
Mac       Miller
Lil        Wayne
Young       Thug
dtype: object

##### Pandas Series can hold a variety of data types

In [5]:
# e.g. int, string, functions, lists
pd.Series([1, 'This is a string', sum,print,len, ['l1',12,'ok']])

0                            1
1             This is a string
2      <built-in function sum>
3    <built-in function print>
4      <built-in function len>
5                 [l1, 12, ok]
dtype: object

###### Getting data from a Pandas Series

In [6]:
# You can call particular data points in the series using the index

# Create Series
crimesAgainstHumanity = {'East Asia':'Uighurs', 'South Asia':'Rohingyas', 'Levant':'Palestinians', 'Arabian Gulf':'Yemenis'}
refugees = pd.Series(crimesAgainstHumanity)

# Retrieve data point from labeled index
refugees['South Asia']

'Rohingyas'

##### Operations with Pandas Series

In [7]:
# With Numbers

# First Series
learn = pd.Series({'podcasts': 1, 'books': 3, 'audiobooks': 2, 'videos': 5, 'courses': 10})
# Second Series
learn2 = pd.Series({'books': 1, 'audiobooks': 4, 'videos': 15, 'courses': 3}) # Where there's no matching index, operations return NaN
# Sum them up 
print(learn + learn2)
# Subtract them 
print(learn - learn2)
# Mutliply them 
print(learn * learn2)
# Divide them
print(learn / learn2)
# Get the remainder
print(learn % learn2)
# Raise to the power
print(learn ** learn2)
# ...

audiobooks     6.0
books          4.0
courses       13.0
podcasts       NaN
videos        20.0
dtype: float64
audiobooks    -2.0
books          2.0
courses        7.0
podcasts       NaN
videos       -10.0
dtype: float64
audiobooks     8.0
books          3.0
courses       30.0
podcasts       NaN
videos        75.0
dtype: float64
audiobooks    0.500000
books         3.000000
courses       3.333333
podcasts           NaN
videos        0.333333
dtype: float64
audiobooks    2.0
books         0.0
courses       1.0
podcasts      NaN
videos        5.0
dtype: float64
audiobooks    1.600000e+01
books         3.000000e+00
courses       1.000000e+03
podcasts      1.000000e+00
videos        3.051758e+10
dtype: float64

In [8]:
# Operating with strings

# First Series
ai = pd.Series({'podcast': 'Lex Fridman', 'book': 'Homo Deus', 'competition': 'XPRIZE', 'deep learning': 'Geoffrey Hinton'})
# Second Series
ai2 = pd.Series({'podcast': 'Talking Machines', 'book': 'The Deep Learning Revolution', 'competition': 'AI for GOOD', 'deep learning': 'Yoshua Bengio'})
# Concatenate 
ai + ', ' + ai2

podcast                    Lex Fridman, Talking Machines
book             Homo Deus, The Deep Learning Revolution
competition                          XPRIZE, AI for GOOD
deep learning             Geoffrey Hinton, Yoshua Bengio
dtype: object

### Pandas Dataframes

##### Creating a pandas df

In [9]:
from numpy.random import randn

moneyball = pd.DataFrame(abs(randn(5,4))/2,['Batting Avg','Hit Percentage','Slugging Percentage','On Base Percentage', 'Home Runs'], ['Christian Yelich', 'Mookie Betts', 'Mike Trout', 'Cody Bellinger'])
moneyball

,Christian Yelich,Mookie Betts,Mike Trout,Cody Bellinger
Batting Avg,0.569497,0.240306,0.177270,0.191070
Hit Percentage,0.010060,0.424066,0.590402,0.759650
Slugging Percentage,0.204622,0.499510,0.110285,0.475756
On Base Percentage,0.351927,0.913976,0.703429,0.885743
Home Runs,0.950284,0.301156,0.128469,1.220040

###### Getting data from a pandas df

In [10]:
# Getting a column returns a series

# Get the stats for Mike Trout
moneyball['Mike Trout']

Batting Avg            0.177270
Hit Percentage         0.590402
Slugging Percentage    0.110285
On Base Percentage     0.703429
Home Runs              0.128469
Name: Mike Trout, dtype: float64

In [11]:
# Getting multiple columns returns a dataframe

# Get the stats for Yelich and Bellinger
moneyball[['Christian Yelich', 'Cody Bellinger']] # Need to pass in the column names as a list in the index

                     Christian Yelich  Cody Bellinger
Batting Avg                  0.569497        0.191070
Hit Percentage               0.010060        0.759650
Slugging Percentage          0.204622        0.475756
On Base Percentage           0.351927        0.885743
Home Runs                    0.950284        1.220040

In [12]:
# Getting 1 row's data returns a series

moneyball.loc['Hit Percentage']

Christian Yelich    0.010060
Mookie Betts        0.424066
Mike Trout          0.590402
Cody Bellinger      0.759650
Name: Hit Percentage, dtype: float64

In [13]:
# Getting mutliple rows' data returns a dataframe

moneyball.loc[['Hit Percentage', 'Batting Avg']]

                Christian Yelich  Mookie Betts  Mike Trout  Cody Bellinger
Hit Percentage          0.010060      0.424066    0.590402         0.75965
Batting Avg             0.569497      0.240306    0.177270         0.19107

In [14]:
# You can also select rows from their numerical index
moneyball.iloc[[1, 3]]

                    Christian Yelich  Mookie Betts  Mike Trout  Cody Bellinger
Hit Percentage              0.010060      0.424066    0.590402        0.759650
On Base Percentage          0.351927      0.913976    0.703429        0.885743

###### Adding new data to a dataframe

In [15]:
# Add a new Column

moneyball['Jose Ramirez'] = abs(np.random.randn(5))/2
moneyball

,Christian Yelich,Mookie Betts,Mike Trout,Cody Bellinger,Jose Ramirez
Batting Avg,0.569497,0.240306,0.177270,0.191070,0.290944
Hit Percentage,0.010060,0.424066,0.590402,0.759650,0.641249
Slugging Percentage,0.204622,0.499510,0.110285,0.475756,0.035798
On Base Percentage,0.351927,0.913976,0.703429,0.885743,0.628037
Home Runs,0.950284,0.301156,0.128469,1.220040,0.693946

In [16]:
# Add a new row
moneyball.loc['On base plus slug'] = moneyball.loc['On Base Percentage'] + moneyball.loc['Slugging Percentage']
moneyball

,Christian Yelich,Mookie Betts,Mike Trout,Cody Bellinger,Jose Ramirez
Batting Avg,0.569497,0.240306,0.177270,0.191070,0.290944
Hit Percentage,0.010060,0.424066,0.590402,0.759650,0.641249
Slugging Percentage,0.204622,0.499510,0.110285,0.475756,0.035798
On Base Percentage,0.351927,0.913976,0.703429,0.885743,0.628037
Home Runs,0.950284,0.301156,0.128469,1.220040,0.693946
On base plus slug,0.556549,1.413487,0.813714,1.361499,0.663835

In [17]:
# Adding columns with arithmetic 

moneyball['Dodgers'] = (moneyball['Mookie Betts'] + moneyball['Cody Bellinger']) / 2
moneyball

,Christian Yelich,Mookie Betts,Mike Trout,Cody Bellinger,Jose Ramirez,Dodgers
Batting Avg,0.569497,0.240306,0.177270,0.191070,0.290944,0.215688
Hit Percentage,0.010060,0.424066,0.590402,0.759650,0.641249,0.591858
Slugging Percentage,0.204622,0.499510,0.110285,0.475756,0.035798,0.487633
On Base Percentage,0.351927,0.913976,0.703429,0.885743,0.628037,0.899860
Home Runs,0.950284,0.301156,0.128469,1.220040,0.693946,0.760598
On base plus slug,0.556549,1.413487,0.813714,1.361499,0.663835,1.387493

##### Removing data from a dataframe

In [18]:
# Disregard a row
moneyball.drop('Home Runs')

,Christian Yelich,Mookie Betts,Mike Trout,Cody Bellinger,Jose Ramirez,Dodgers
Batting Avg,0.569497,0.240306,0.177270,0.191070,0.290944,0.215688
Hit Percentage,0.010060,0.424066,0.590402,0.759650,0.641249,0.591858
Slugging Percentage,0.204622,0.499510,0.110285,0.475756,0.035798,0.487633
On Base Percentage,0.351927,0.913976,0.703429,0.885743,0.628037,0.899860
On base plus slug,0.556549,1.413487,0.813714,1.361499,0.663835,1.387493

In [19]:
# Note: The dropped row is still in the actual dataframe
moneyball

,Christian Yelich,Mookie Betts,Mike Trout,Cody Bellinger,Jose Ramirez,Dodgers
Batting Avg,0.569497,0.240306,0.177270,0.191070,0.290944,0.215688
Hit Percentage,0.010060,0.424066,0.590402,0.759650,0.641249,0.591858
Slugging Percentage,0.204622,0.499510,0.110285,0.475756,0.035798,0.487633
On Base Percentage,0.351927,0.913976,0.703429,0.885743,0.628037,0.899860
Home Runs,0.950284,0.301156,0.128469,1.220040,0.693946,0.760598
On base plus slug,0.556549,1.413487,0.813714,1.361499,0.663835,1.387493

In [20]:
# You have to specify that you want to remove it in place (pandas safety feature for not losing data)
moneyball.drop('Home Runs', axis=0, inplace=True)
moneyball

,Christian Yelich,Mookie Betts,Mike Trout,Cody Bellinger,Jose Ramirez,Dodgers
Batting Avg,0.569497,0.240306,0.177270,0.191070,0.290944,0.215688
Hit Percentage,0.010060,0.424066,0.590402,0.759650,0.641249,0.591858
Slugging Percentage,0.204622,0.499510,0.110285,0.475756,0.035798,0.487633
On Base Percentage,0.351927,0.913976,0.703429,0.885743,0.628037,0.899860
On base plus slug,0.556549,1.413487,0.813714,1.361499,0.663835,1.387493

In [21]:
# Disregard a column

# Specify axis = 1 for columns
moneyball.drop('Dodgers', axis=1)

,Christian Yelich,Mookie Betts,Mike Trout,Cody Bellinger,Jose Ramirez
Batting Avg,0.569497,0.240306,0.177270,0.191070,0.290944
Hit Percentage,0.010060,0.424066,0.590402,0.759650,0.641249
Slugging Percentage,0.204622,0.499510,0.110285,0.475756,0.035798
On Base Percentage,0.351927,0.913976,0.703429,0.885743,0.628037
On base plus slug,0.556549,1.413487,0.813714,1.361499,0.663835

In [22]:
# Dropped column still in dataframe

moneyball

,Christian Yelich,Mookie Betts,Mike Trout,Cody Bellinger,Jose Ramirez,Dodgers
Batting Avg,0.569497,0.240306,0.177270,0.191070,0.290944,0.215688
Hit Percentage,0.010060,0.424066,0.590402,0.759650,0.641249,0.591858
Slugging Percentage,0.204622,0.499510,0.110285,0.475756,0.035798,0.487633
On Base Percentage,0.351927,0.913976,0.703429,0.885743,0.628037,0.899860
On base plus slug,0.556549,1.413487,0.813714,1.361499,0.663835,1.387493

In [23]:
# Remove the column data completely 
moneyball.drop('Dodgers', axis=1, inplace=True)
moneyball

,Christian Yelich,Mookie Betts,Mike Trout,Cody Bellinger,Jose Ramirez
Batting Avg,0.569497,0.240306,0.177270,0.191070,0.290944
Hit Percentage,0.010060,0.424066,0.590402,0.759650,0.641249
Slugging Percentage,0.204622,0.499510,0.110285,0.475756,0.035798
On Base Percentage,0.351927,0.913976,0.703429,0.885743,0.628037
On base plus slug,0.556549,1.413487,0.813714,1.361499,0.663835

In [24]:
# Get the dataframe's shape (rows, cols)
moneyball.shape

(5, 5)

##### Getting specific subsets of the dataframe

In [25]:
# Get Cody Bellinger's hit percentage
moneyball.loc['Hit Percentage', 'Cody Bellinger']

0.7596500856365155

In [26]:
# Get Mike Trout, Jose Ramirez, and Mookie Betts' on base percentage, hit percentage, and slugging percentages
# Syntax df.loc[rows,cols]
moneyball.loc[['Hit Percentage','Slugging Percentage','On Base Percentage'], ['Mike Trout', 'Jose Ramirez', 'Mookie Betts']]

                     Mike Trout  Jose Ramirez  Mookie Betts
Hit Percentage         0.590402      0.641249      0.424066
Slugging Percentage    0.110285      0.035798      0.499510
On Base Percentage     0.703429      0.628037      0.913976

##### Conditional Selection

In [27]:
# Only select the stats where Mike Trout scores better than 0.3
goodStats = moneyball[moneyball['Mike Trout'] > 0.3] # Batting average and On base plus slug
goodStats

,Christian Yelich,Mookie Betts,Mike Trout,Cody Bellinger,Jose Ramirez
Hit Percentage,0.010060,0.424066,0.590402,0.759650,0.641249
On Base Percentage,0.351927,0.913976,0.703429,0.885743,0.628037
On base plus slug,0.556549,1.413487,0.813714,1.361499,0.663835

In [28]:
# You can select certain items from a conditionally selected subset of the df

# See how Yelich and Betts score on batting average and obp
goodStats[['Christian Yelich', 'Mookie Betts']]

                    Christian Yelich  Mookie Betts
Hit Percentage              0.010060      0.424066
On Base Percentage          0.351927      0.913976
On base plus slug           0.556549      1.413487

In [29]:
# You can stack the conditional and index selection commands 

# Mike Trout's stats where Mike Trout scores less than 0.3
moneyball[moneyball['Mike Trout'] < 0.3]['Mike Trout']

Batting Avg            0.177270
Slugging Percentage    0.110285
Name: Mike Trout, dtype: float64

In [30]:
# See where Ramirez and Bellinger score more than 0.3
moneyball[moneyball[['Cody Bellinger', 'Jose Ramirez']] > 0.3][['Jose Ramirez', 'Cody Bellinger']]

                     Jose Ramirez  Cody Bellinger
Batting Avg                   NaN             NaN
Hit Percentage           0.641249        0.759650
Slugging Percentage           NaN        0.475756
On Base Percentage       0.628037        0.885743
On base plus slug        0.663835        1.361499

##### Conditional Selection with multiple conditions 

Use `&` or `|`

In [31]:
# See where Cody Bellinger does well AND Mike Trout does poorly
moneyball[(moneyball['Mike Trout'] < 0.3) & (moneyball['Cody Bellinger'] > 0.3)][['Cody Bellinger', 'Mike Trout']]

                     Cody Bellinger  Mike Trout
Slugging Percentage        0.475756    0.110285

In [32]:
# Select the best batter for the Dodgers: See where Cody Bellinger does well or Mookie Betts does well
moneyball[(moneyball['Mookie Betts'] > 0.3) | (moneyball['Cody Bellinger'] > 0.3)][['Cody Bellinger', 'Mookie Betts']]

                     Cody Bellinger  Mookie Betts
Hit Percentage             0.759650      0.424066
Slugging Percentage        0.475756      0.499510
On Base Percentage         0.885743      0.913976
On base plus slug          1.361499      1.413487

##### Resetting the labeled indices to a column

In [33]:
# Put the labels in a column
moneyball.reset_index() # This doesn't occur in place unless you specify inplace=True

,index,Christian Yelich,Mookie Betts,Mike Trout,Cody Bellinger,Jose Ramirez
0,Batting Avg,0.569497,0.240306,0.177270,0.191070,0.290944
1,Hit Percentage,0.010060,0.424066,0.590402,0.759650,0.641249
2,Slugging Percentage,0.204622,0.499510,0.110285,0.475756,0.035798
3,On Base Percentage,0.351927,0.913976,0.703429,0.885743,0.628037
4,On base plus slug,0.556549,1.413487,0.813714,1.361499,0.663835

In [34]:
# Example of resetting and setting the index

# Create a dataframe
songs = ['Alf Leila W Leila', 'Ah W Noss', 'Mahragan Bent El Geran', 'Desert Rose', 'From Jeddah to LA']
artists = ['Umm Kulthum', 'Nancy Ajram', 'Hassan Shakosh', 'Sting', 'Qusai']
df = pd.DataFrame(songs, artists, ['Song'])
df

                                  Song
Umm Kulthum          Alf Leila W Leila
Nancy Ajram                  Ah W Noss
Hassan Shakosh  Mahragan Bent El Geran
Sting                      Desert Rose
Qusai                From Jeddah to LA

In [35]:
# Reset the index to 0,1,2,3...
df.reset_index(inplace=True)

In [36]:
# Add a column
df['Genre'] = ['Classical Egyptian', 'Arabic Pop', 'Sha3by', 'Rock', 'Hip Hop']
# Set the column data as the indices
df.set_index('Genre')

                             index                    Song
Genre
Classical Egyptian     Umm Kulthum       Alf Leila W Leila
Arabic Pop             Nancy Ajram               Ah W Noss
Sha3by              Hassan Shakosh  Mahragan Bent El Geran
Rock                         Sting             Desert Rose
Hip Hop                      Qusai       From Jeddah to LA

In [37]:
# Just for clarity, rename the old index data to what they represent
df['Artist'] = df['index']
df.drop('index', axis=1, inplace=True)
df

                     Song               Genre          Artist
0       Alf Leila W Leila  Classical Egyptian     Umm Kulthum
1               Ah W Noss          Arabic Pop     Nancy Ajram
2  Mahragan Bent El Geran              Sha3by  Hassan Shakosh
3             Desert Rose                Rock           Sting
4       From Jeddah to LA             Hip Hop           Qusai

### Hierarchical indexing 

###### Creating a dataframe with multi-index levels

Dataframes can have as many index layers as you want

In [38]:
# Index level 
outside = ['G1', 'G1', 'G1', 'G2', 'G2', 'G2']
# Index level
inside = [1,2,3,1,2,3]
# Pair the values from each index level together in a list of tuples
hierarchicalIndex = list(zip(outside, inside))
# Create multi-index levels  
hierarchicalIndex = pd.MultiIndex.from_tuples(hierarchicalIndex)
hierarchicalIndex

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [39]:
# Create a dataframe with multi-index levels
df = pd.DataFrame(np.random.randn(6,2), hierarchicalIndex, ['A','B'])
df # Shows the outside index level and inside index level

             A         B
G1 1 -1.498710  1.108396
   2  1.167638  0.434092
   3  0.213168  1.504804
G2 1 -0.014228 -1.088841
   2 -1.591891  0.730687
   3  0.500184 -0.561454

##### Getting data from dataframes with multi-index levels

You call from the outside index towards the inside levels

In [40]:
# Get data from outer level
df.loc['G1']

          A         B
1 -1.498710  1.108396
2  1.167638  0.434092
3  0.213168  1.504804

In [41]:
# Get data from inner levels: index the outer level, then the deeper level
df.loc['G1'].loc[2]

A    1.167638
B    0.434092
Name: 2, dtype: float64

In [42]:
# get one particular data point
df['B'].loc['G1'].loc[2] # Or df.loc['G1'].loc[2]['B']

0.43409158857951397

###### Naming the index levels

In [43]:
# Get the names of the index levels
df.index.names # no names yet

FrozenList([None, None])

In [44]:
# Set the names of the index levels
df.index.names = ['Group', 'Participant']
df.index.names

FrozenList(['Group', 'Participant'])

In [45]:
# show how the index names appear in the dataframe
df

                          A         B
Group Participant
G1    1           -1.498710  1.108396
      2            1.167638  0.434092
      3            0.213168  1.504804
G2    1           -0.014228 -1.088841
      2           -1.591891  0.730687
      3            0.500184 -0.561454

###### Grabbing data with the cross section `xs` method

In [46]:
# xs can grab data from the outer level easily
df.xs('G1')

                    A         B
Participant
1           -1.498710  1.108396
2            1.167638  0.434092
3            0.213168  1.504804

In [47]:
# Unlike loc, xs can also grab data from the INNER LEVELS easily. You just have to specify the level.
df.xs(3,level='Participant')

              A         B
Group
G1     0.213168  1.504804
G2     0.500184 -0.561454

### Missing Data

In the case where there is missing data, Pandas will automatically fill in the missing data points with `NaN` values

In [50]:
# Create a df with missing data

# Dict with NaN to mimick missing data
d = {'Bench':[120,np.nan,180],'Row':[150,160,170],'Squat':[200,np.nan,np.nan]}
# Create a df from the dict
df = pd.DataFrame(d)
df

   Bench  Row  Squat
0  120.0  150  200.0
1    NaN  160    NaN
2  180.0  170    NaN

#### Dropping missing values from the dataset

Sometimes, if there are only a few missing values in the data, the best option is to just drop them using `dropna`

##### Dropping rows with missing values

In [51]:
# Calling df.dropna drops any row with any number of NaN values
df.dropna() # only the '0' row is complete

   Bench  Row  Squat
0  120.0  150  200.0

##### Dropping columns with missing values

In [52]:
# You can specify axis=1 to drop the columns that contain NaN (missing) values
df.dropna(axis=1) # only the 'Row' column is complete

   Row
0  150
1  160
2  170

##### Threshold for dropping rows/columns with missing values

You can set the threshold for how many missing values (NaN) need to be in the row or column for it to be dropped

In [56]:
# with rows

# Row needs to have at least 2 missing values to be dropped
df.dropna(thresh=2) # only drops row 1 (keeps row 2 because it onlu has one NaN)

   Bench  Row  Squat
0  120.0  150  200.0
2  180.0  170    NaN

In [58]:
# with columns

# Column needs to have at least 2 missing values to be dropped
df.dropna(axis=1,thresh=2) # only drops column 'Squat' (keeps column 'Bench' because it only has one NaN)

   Bench  Row
0  120.0  150
1    NaN  160
2  180.0  170

#### Filling missing values in the data set 

You can use `fillna` to fill in empty values in the dataset

##### Fill in all empty values with the same value

In [59]:
# fill in all the missing values with 220
df.fillna(220)

   Bench  Row  Squat
0  120.0  150  200.0
1  220.0  160  220.0
2  180.0  170  220.0

###### Fill missing values in a particular column manually

In [67]:
# Fill each column with a different value
print(df['Bench'].fillna(160))
df['Squat'].fillna(230)

0    120.0
1    160.0
2    180.0
Name: Bench, dtype: float64

0    200.0
1    230.0
2    230.0
Name: Squat, dtype: float64

##### Fill missing values in columns with the mean of the column values (very common)

In [68]:
print(df['Bench'].fillna(df['Bench'].mean())) # missing values takes on the mean of the filled bench values 
df['Squat'].fillna(df['Squat'].mean()) # missing values take on the mean of the filled squat values

0    120.0
1    150.0
2    180.0
Name: Bench, dtype: float64

0    200.0
1    200.0
2    200.0
Name: Squat, dtype: float64

### Groupby 

`groupby` allows you to group certain rows based off of their value in a column and perform an aggregate function on them

In [73]:
# Create a dataframe
data = {'Company':['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'], 
        'Person':['Ali', 'Shereen','Omar', 'Abdulrahman', 'Joud','Zein'],
        'Sales':[120,200,340,123,248,349]
       }
df = pd.DataFrame(data)
df

  Company       Person  Sales
0    GOOG          Ali    120
1    GOOG      Shereen    200
2    MSFT         Omar    340
3    MSFT  Abdulrahman    123
4      FB         Joud    248
5      FB         Zein    349

In [74]:
# Group by Company
byComp = df.groupby('Company')
# Call an aggregate function on it
byComp.mean()

         Sales
Company
FB       298.5
GOOG     160.0
MSFT     231.5

In [75]:
# Call another aggregate function on it
byComp.sum()

         Sales
Company
FB         597
GOOG       320
MSFT       463

In [76]:
# And another
byComp.std()

              Sales
Company
FB        71.417785
GOOG      56.568542
MSFT     153.442172

In [77]:
# In real examples, we do it all in one line to find te desired value

# Realistic use case: get the total sales for FaceBook
df.groupby('Company').sum().loc['FB']

Sales    597
Name: FB, dtype: int64

In [78]:
# Get the average sales per employee for Microsoft
df.groupby('Company').mean().loc['MSFT']

Sales    231.5
Name: MSFT, dtype: float64

In [80]:
# Count the number of employees at Google
df.groupby('Company').count().loc['GOOG']['Person']

2

In [96]:
# Get the the lowest sales
df.groupby('Company').sum().min()

Sales    320
dtype: int64

In [98]:
# Check if Google got the lowest sales
df.groupby('Company').sum().loc['GOOG']

Sales    320
Name: GOOG, dtype: int64

#### Describe 

Using `groupby` with the `describe` method gives us all sorts of useful statistical information.

In [99]:
# Describe the company sales info
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  298.5   71.417785  248.0  273.25  298.5  323.75  349.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  231.5  153.442172  123.0  177.25  231.5  285.75  340.0

### Merging, Joining, and Concatenating DataFrames

###### Create 3 dataframes to demo

In [103]:
df1 = pd.DataFrame({
    'A':['A0','A1','A2','A3'],
    'B':['B0','B1','B2','B3'],
    'C':['C0','C1','C2','C3'],
    'D':['D0','D1','D2','D3']}, 
    index = [0,1,2,3])
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [104]:
df2 = pd.DataFrame({
    'A':['A4','A5','A6','A7'],
    'B':['B4','B5','B6','B7'],
    'C':['C4','C5','C6','C7'],
    'D':['D4','D5','D6','D7']}, 
    index = [4,5,6,7])
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [105]:
df3 = pd.DataFrame({
    'A':['A8','A9','A10','A11'],
    'B':['B8','B9','B10','B11'],
    'C':['C8','C9','C10','C11'],
    'D':['D8','D9','D10','D11']}, 
    index = [8,9,10,11])
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

##### Concatenation

Concatenation glues together DataFrames. Dimensions need to match along the axis you are concatenating on. You can use `pd.concat` and pass in a list of DataFrames to concatenate together.

In [106]:
# Concatenate df1, df2, df3 
pd.concat([df1,df2,df3]) # By default, concat along the row axis (axis=0). You can set to axis=1 if you want to concatenate along the column axis

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [113]:
# concatenate df1, df2, df3 along the column axis
pd.concat([df1,df2,df3], axis=1) # Missing values

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [114]:
# Just for demo: Ignore the indices and concatenate df1, df2, df3 along the column axis
pd.concat([df1,df2.reset_index().drop('index', axis=1),df3.reset_index().drop('index', axis=1)], axis=1)

    A   B   C   D   A   B   C   D    A    B    C    D
0  A0  B0  C0  D0  A4  B4  C4  D4   A8   B8   C8   D8
1  A1  B1  C1  D1  A5  B5  C5  D5   A9   B9   C9   D9
2  A2  B2  C2  D2  A6  B6  C6  D6  A10  B10  C10  D10
3  A3  B3  C3  D3  A7  B7  C7  D7  A11  B11  C11  D11

##### Merging

The `merge` function allows you to merge DataFrames together on a particular column.

In [115]:
# Create two dataframes
left = pd.DataFrame({'A':['A0','A1','A2','A3'],
                    'B':['B0','B1','B2','B3'],
                    'key':['K0','K1','K2','K3']})

right = pd.DataFrame({'key':['K0','K1','K2','K3'],
                      'C':['C0','C1','C2','C3'],
                      'D':['D0','D1','D2','D3']})

In [116]:
# Merge them together
pd.merge(left,right) # merge(left_df,right_df,how=inner,on=indexOrColumnYouWantToMergeOn)

    A   B key   C   D
0  A0  B0  K0  C0  D0
1  A1  B1  K1  C1  D1
2  A2  B2  K2  C2  D2
3  A3  B3  K3  C3  D3

###### Merging on mutliple keys

In [118]:
left = pd.DataFrame({
    'key1':['K0','K0','K1','K1'],
    'key2':['K1','K0','K0','K1'],
    'A':['A0','A1','A2','A3'],
    'B':['B0','B1','B2','B3']
})

right = pd.DataFrame({'key1':['K0','K1','K2','K3'],
                      'key2':['K0','K1','K1','K2'],
                      'C':['C0','C1','C2','C3'],
                      'D':['D0','D1','D2','D3']})

# Merge on both keys: Keeps values where key1 and key2 of the right DataFrame match key1,key2 of the left DataFrame 
pd.merge(left,right,on=['key1','key2']) # Here, right['key1'/'key2'][0] == left['key1'/'key2'][1] and left['key1'/'key2'][3] == right['key1'/'key2'][1]

  key1 key2   A   B   C   D
0   K0   K0  A1  B1  C0  D0
1   K1   K1  A3  B3  C1  D1

###### The `how` parameter in `merge`

In [121]:
# default: inner = intersection of the key values (where they match only)
pd.merge(left,right,how='inner',on='key1')

  key1 key2_x   A   B key2_y   C   D
0   K0     K1  A0  B0     K0  C0  D0
1   K0     K0  A1  B1     K0  C0  D0
2   K1     K0  A2  B2     K1  C1  D1
3   K1     K1  A3  B3     K1  C1  D1

In [122]:
# outer = union of the two keys (any key value in left or right)
pd.merge(left,right,how='outer',on='key1') # note, if a key value exists in one DF but not the other, merging will produce NaN values where it's missing

  key1 key2_x    A    B key2_y   C   D
0   K0     K1   A0   B0     K0  C0  D0
1   K0     K0   A1   B1     K0  C0  D0
2   K1     K0   A2   B2     K1  C1  D1
3   K1     K1   A3   B3     K1  C1  D1
4   K2    NaN  NaN  NaN     K1  C2  D2
5   K3    NaN  NaN  NaN     K2  C3  D3

In [123]:
#left = use only the keys present in the left dataframe
pd.merge(left,right,how='left',on='key1')

  key1 key2_x   A   B key2_y   C   D
0   K0     K1  A0  B0     K0  C0  D0
1   K0     K0  A1  B1     K0  C0  D0
2   K1     K0  A2  B2     K1  C1  D1
3   K1     K1  A3  B3     K1  C1  D1

In [124]:
#right = use only the keys present in the right dataframe
pd.merge(left,right,how='right',on='key1')

  key1 key2_x    A    B key2_y   C   D
0   K0     K1   A0   B0     K0  C0  D0
1   K0     K0   A1   B1     K0  C0  D0
2   K1     K0   A2   B2     K1  C1  D1
3   K1     K1   A3   B3     K1  C1  D1
4   K2    NaN  NaN  NaN     K1  C2  D2
5   K3    NaN  NaN  NaN     K2  C3  D3

##### Joining

`Joining` is a way of combining the columns of two potentially differently-indexed DataFrames into a single result. default `how` is left.

###### Same indexing

In [127]:
#Create df
df1 = pd.DataFrame({
    'A':['A0','A1','A2','A3'],
    'B':['B0','B1','B2','B3']},
    index=['K0','K1','K2','K3'])

df2 = pd.DataFrame({
    'C':['C0','C1','C2','C3'],
    'D':['D0','D1','D2','D3']},
    index=['K0','K1','K2','K3'])

#join df
df1.join(df2) # same indexing joins

     A   B   C   D
K0  A0  B0  C0  D0
K1  A1  B1  C1  D1
K2  A2  B2  C2  D2
K3  A3  B3  C3  D3

###### Same indexing, different order

In [129]:
#Create df
df1 = pd.DataFrame({
    'A':['A0','A1','A2','A3'],
    'B':['B0','B1','B2','B3']},
    index=['K0','K1','K2','K3'])

df2 = pd.DataFrame({
    'C':['C0','C1','C2','C3'],
    'D':['D0','D1','D2','D3']},
    index=['K3','K2','K1','K0'])

#Join df
df1.join(df2)

     A   B   C   D
K0  A0  B0  C3  D3
K1  A1  B1  C2  D2
K2  A2  B2  C1  D1
K3  A3  B3  C0  D0

###### different indexing, some overlap

In [135]:
#Create df
df1 = pd.DataFrame({
    'A':['A0','A1','A2','A3'],
    'B':['B0','B1','B2','B3']},
    index=['K0','K1','K2','K3'])

df2 = pd.DataFrame({
    'C':['C0','C1','C2','C3'],
    'D':['D0','D1','D2','D3']},
    index=['K2','K3','K4','K5'])

#Join df
df1.join(df2) # defaults to left, to get intersection choose how='inner'

     A   B    C    D
K0  A0  B0  NaN  NaN
K1  A1  B1  NaN  NaN
K2  A2  B2   C0   D0
K3  A3  B3   C1   D1

In [136]:
# Get the corresponding values
df1.join(df2,how='inner')

     A   B   C   D
K2  A2  B2  C0  D0
K3  A3  B3  C1  D1

###### different indexing, no overlap

In [138]:
#Create df
df1 = pd.DataFrame({
    'A':['A0','A1','A2','A3'],
    'B':['B0','B1','B2','B3']},
    index=['K0','K1','K2','K3'])

df2 = pd.DataFrame({
    'C':['C0','C1','C2','C3'],
    'D':['D0','D1','D2','D3']},
    index=['K4','K5','K6','K7'])

#Join df
df1.join(df2) # no values for df2

     A   B    C    D
K0  A0  B0  NaN  NaN
K1  A1  B1  NaN  NaN
K2  A2  B2  NaN  NaN
K3  A3  B3  NaN  NaN

In [139]:
# right
df1.join(df2,how='right') # no values for df1

      A    B   C   D
K4  NaN  NaN  C0  D0
K5  NaN  NaN  C1  D1
K6  NaN  NaN  C2  D2
K7  NaN  NaN  C3  D3

In [140]:
#inner
df1.join(df2, how='inner') # nothing

Empty DataFrame
Columns: [A, B, C, D]
Index: []

In [141]:
#outer
df1.join(df2, how='outer') # no overlapping values. df1 where indexed, df2 where indexed

      A    B    C    D
K0   A0   B0  NaN  NaN
K1   A1   B1  NaN  NaN
K2   A2   B2  NaN  NaN
K3   A3   B3  NaN  NaN
K4  NaN  NaN   C0   D0
K5  NaN  NaN   C1   D1
K6  NaN  NaN   C2   D2
K7  NaN  NaN   C3   D3

### DataFrame Operations

In [146]:
df = pd.DataFrame({
    'col1':[1,2,3,4],
    'col2':[444,555,666,444],
    'col3':['abc','def','ghi','xyz']})
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

#### Finding unique values in a DataFrame

In [148]:
# Get unique values in a column
df['col2'].unique()

array([444, 555, 666])

In [149]:
# Get the number of unique vales in a column
df['col2'].nunique()

3

In [152]:
# Get the values in the column and how many times they appear
df['col2'].value_counts() # 2 x 444

444    2
555    1
666    1
Name: col2, dtype: int64

#### Apply

`apply` allows you to apply a function to every value along an axis in a DataFrame.

##### Applying built-in functions

In [171]:
# Apply the length function to every value in column 3
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

##### Applying custom functions

In [167]:
# Define a function
def quotes(letter):
    if letter == 'abc':
        return 'Sea turtles mate'
    elif letter == 'def':
        return 'My incredibly intuitive sense of the female creature tells me you’re troubled.'
    elif letter == 'ghi':
        return 'But why is the rum gone!?'
    else:
        return 'Who am I? I\'m captain Jack Sparrow'
    
#apply the function to all the values in column 3
df['col3'].apply(quotes)

0                                     Sea turtles mate
1    My incredibly intuitive sense of the female cr...
2                            But why is the rum gone!?
3                   Who am I? I'm captain Jack Sparrow
Name: col3, dtype: object

##### Applying lambda functions

`apply` is especially powerful with lambda functions. Allowing you to apply functionality easily on the go.

In [172]:
# Get the cubed value of every value in column 2
df['col2'].apply(lambda x: x**3)

0     87528384
1    170953875
2    295408296
3     87528384
Name: col2, dtype: int64

#### Removing columns (reminder)

In [173]:
# Remove column 1 from the dataframe
df.drop('col1',axis=1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

#### Get the index and column names from a DataFrame

In [174]:
# index
df.index

RangeIndex(start=0, stop=4, step=1)

In [176]:
# column
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

#### Sorting a DataFrame

In [177]:
# Sort the DataFrame from lowest to highest values in column 2
df.sort_values('col2') # note: index stays with appropriate row

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [178]:
# Sort the DataFrame from highest to lowest values in column 2
df.sort_values('col2',ascending=False) # note: index stays with appropriate row

   col1  col2 col3
2     3   666  ghi
1     2   555  def
0     1   444  abc
3     4   444  xyz

#### Find null values in the DataFrame

In [185]:
# Check for null values
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

#### Pivot Tables

In [188]:
df = pd.DataFrame({
    'A':['foo','foo','foo','bar','bar','bar'],
    'B':['one','one','two','two','one','one'],
    'C':['x','y','x','y','x','y'],
    'D':[1,3,2,5,4,1]})
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [190]:
# Create a pivot table with the values in D, with A and B as hierarchical indices, and C as the column
df.pivot_table(values='D',index=['A','B'],columns='C')

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [191]:
# Create a pivot table with the values in D, with A and C as hierarchical indices, and B as the column
df.pivot_table(values='D',index=['A','C'],columns='B')

B      one  two
A   C
bar x  4.0  NaN
    y  1.0  5.0
foo x  1.0  2.0
    y  3.0  NaN

In [206]:
# Create a pivot table with the values in D, indexed by A, with Cand B as the columns
df.pivot_table(values='D',index='A',columns=['B','C'])

B    one       two
C      x    y    x    y
A
bar  4.0  1.0  NaN  5.0
foo  1.0  3.0  2.0  NaN